# Taps
tap "homebrew/cask"
tap "go-task/tap"
tap "goreleaser/tap"
tap "itsdalmo/tap"
tap "warrensbox/tap"

# Apps
cask "firefox"
cask "iterm2"
cask "visual-studio-code"
cask "intellij-idea"
cask "goland"
cask "aws-vault"
cask "docker"
cask "keybase"
cask "slack"
cask "discord"
cask "spotify"
cask "signal"
cask "postman"
cask "zoom"
cask "google-cloud-sdk"

# Packages
brew "mas"
brew "dockutil"
brew "gpg"
brew "pinentry-mac"
brew "go"
brew "nvm"
brew "typescript"
brew "yarn"
brew "python"
brew "packer"
brew "awscli"
brew "fzf"
brew "jq"
brew "ripgrep"
brew "exa"
brew "vim"
brew "vaulted"
brew "shellcheck"
brew "gh"
brew "hugo"
brew "bazelisk"
brew "kubectx"
brew "kustomize"
brew "go-task/tap/go-task"
brew "goreleaser/tap/goreleaser"
brew "warrensbox/tap/tfswitch"

# Mac store
mas "cinch", id: 412529613
mas "1Password", id: 1333542190
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft Powerpoint", id: 462062816
