# Taps
tap "homebrew/cask"
tap "go-task/tap"
tap "goreleaser/tap"
tap "itsdalmo/tap"
tap "warrensbox/tap"
tap "homebrew/cask-fonts"
tap "adoptopenjdk/openjdk"
tap "bufbuild/buf"

# Apps
cask "rectangle"
cask "firefox"
cask "brave-browser"
cask "font-jetbrains-mono-nerd-font"
cask "wezterm"
cask "visual-studio-code"
cask "goland"
cask "aws-vault"
cask "docker"
cask "multipass"
cask "keybase"
cask "slack"
cask "discord"
cask "spotify"
cask "signal"
cask "postman"
cask "google-cloud-sdk"
cask "sensiblesidebuttons"
cask "adoptopenjdk11"

# Packages
brew "fish"
brew "coreutils"
brew "mas"
brew "dockutil"
brew "gpg"
brew "pinentry-mac"
brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "graphviz"
brew "nvm"
brew "typescript"
brew "yarn"
brew "pyenv"
brew "gnu-sed"
brew "packer"
brew "awscli"
brew "fzf"
brew "jq"
brew "jsonlint"
brew "ripgrep"
brew "fd"
brew "exa"
brew "zoxide"
brew "nvim"
brew "vaulted"
brew "shellcheck"
brew "hugo"
brew "bazelisk"
brew "buildifier"
brew "kubectx"
brew "kustomize"
brew "protobuf"
brew "gh"
brew "go-task/tap/go-task"
brew "goreleaser/tap/goreleaser"
brew "warrensbox/tap/tfswitch"
brew "bufbuild/buf/buf"

# Mac store
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft Powerpoint", id: 462062816
mas "Xcode", id: 497799835
mas "Agenda", id: 1287445660
